export const categories = [
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 1
    },
    {
        name: 'Красота',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 2
    },
    {
        name: 'Аренда',
        subCategories: ['Ремонт ', 'Сантехнические работы и отопление', 'Ремонт к', 'Сантехничение', 'Ремонтр и домов', 'Сантские работы и отопление', 'Ремони домов', 'ческие работы и отопление'],
        id: 3
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 4
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 5
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 6
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 7
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 8
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 9
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 10
    },
    {
        name: 'Красота',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 11
    },
    {
        name: 'Аренда',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 12
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 13
    },
    {
        name: 'Красота',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 14
    },
    {
        name: 'Аренда',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 15
    },
    {
        name: 'Ремонт и установка техники',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 16
    },
    {
        name: 'Красота',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 17
    },
    {
        name: 'Аренда',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 18
    },
    {
        name: 'Творчество, рукоделие и хобби',
        subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
        id: 19
    }
]

export const categories2 = {
    categories: [
        {
            name: 'Ремонт и установка техники',
            subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
            id: 1
        },
        {
            name: 'Красота',
            subCategories: ['Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление', 'Ремонт квартир и домов', 'Сантехнические работы и отопление'],
            id: 2
        },
        {
            name: 'Аренда',
            subCategories: ['Ремонт ', 'Сантехнические работы и отопление', 'Ремонт к', 'Сантехничение', 'Ремонтр и домов', 'Сантские работы и отопление', 'Ремони домов', 'ческие работы и отопление'],
            id: 3
        }
    ],
    inputDate: [
        {
            fieldValue: '',
            fromTime: '',
            toTime: '',
        }
    ]
}

